<a href="https://colab.research.google.com/github/Raian-Rahman/Competitive-Programming-templates/blob/master/DataFrame/DataFrameBasic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

The DataFrame data structure is the heart of the Panda's library. It's a primary object that you'll be working with in data analysis and cleaning tasks.

#The DataFrame is conceptually a two-dimensional series object
 where there's an **index and multiple columns of content**, with *each column having a label*. In fact, the distinction between a column and a row is really only a conceptual distinction. And you can think of the DataFrame itself as simply a two-axes labeled array.

In [0]:
#lets create a dataframe 
#a datafrane can be thought as list of series where each series indicates a row
import pandas as pd

Team1 = pd.Series({
        'captain' : 'Shakib',
        'Vice Captain' : 'Tamim'
    }
)

Team2 = pd.Series(
    {
        'captain' : 'MS Dhoni',
        'Vice Captain' : 'Virat'
    }
)

Team3 = pd.Series(
    {
        'captain' : 'Warner',
        'Vice Captain' : 'Smith'
    }
)

df = pd.DataFrame([Team1,Team2,Team3],index = ['Bangladesh','India','Australia'])
print(df)

In [7]:
df.loc['Bangladesh']['captain']

'Shakib'

In [8]:
df.iloc[0]['Vice Captain']

'Tamim'

Now if we had multiple row as **Bangladesh** index then the loc attribute would return all the rows with index named '**Bangladesh**'

In [0]:
df1 = pd.DataFrame([Team3],index = ['Australia'])
df1 = df.append(df1
)

In [14]:
print(df1)

             captain Vice Captain
Bangladesh    Shakib        Tamim
India       MS Dhoni        Virat
Australia     Warner        Smith
Australia     Warner        Smith

In [17]:
df1.loc['Australia','captain']

Australia    Warner
Australia    Warner
Name: captain, dtype: object

Here we can see multiple rows return for **Australia**

#Select Column for loc attribute

The standart code is df.loc['index',col]

In [20]:
df.loc['Bangladesh','Vice Captain']
df.loc['Bangladesh','captain']

'Shakib'

### Another way is to use the transpose attribute.

In [24]:
df.T.loc['captain']['Bangladesh']

'Shakib'

In [27]:
df.T.loc['Vice Captain']['Bangladesh']

'Tamim'

#For Selecting Multiple Columns

it will take the index as the first parameter and the list of column name as the second parameter

In [28]:
df.loc['Bangladesh',['captain','Vice Captain']]

captain         Shakib
Vice Captain     Tamim
Name: Bangladesh, dtype: object

In [29]:
df.loc[:,['captain','Vice Captain']]

             captain Vice Captain
Bangladesh    Shakib        Tamim
India       MS Dhoni        Virat
Australia     Warner        Smith

#Dropping Data in DataFrame

It's easy to delete data in series and DataFrames, and we can use the ***drop function*** to do so. This function takes a single parameter, ***which is the index or roll label, to drop***. This is another tricky place for new users to pad this. 

```
df.drop('Bangladesh')
```

The drop function doesn't **change the DataFrame by default.** And instead, returns to you a copy of the DataFrame with the given rows removed. We can see that our original DataFrame is still intact. Let's make a copy with the copy method and do a drop on it instead.

In [38]:
df1 = df.copy()
df1 = df1.drop('Australia')
print(df1)

             captain Vice Captain
Bangladesh    Shakib        Tamim
India       MS Dhoni        Virat

In [39]:
df1 = df
df1 = df1.T.drop('captain')
print(df1)

             Bangladesh  India Australia
Vice Captain      Tamim  Virat     Smith

In [40]:
print(df)

             captain Vice Captain
Bangladesh    Shakib        Tamim
India       MS Dhoni        Virat
Australia     Warner        Smith

#Drop has two interesting optional parameters. 
* The first is called ***in place***, and if it's set to 
true, the DataFrame will be updated in place, instead of a copy being returned. 
* The second parameter is ***the axes***, which should be dropped. By default, this value is 0, indicating the row axes. But you could change it to 1 if you want to drop a column.  **THUS YOU WONT NEED TO TRANSPOSE**

In [0]:
df.drop('captain',inplace = True, axis = 1)

In [42]:
df

           Vice Captain
Bangladesh        Tamim
India             Virat
Australia         Smith

#Deleting Column using del operator

In [0]:
df = df1
df = df.T

del df['Vice Captain']

In [49]:
df

Empty DataFrame
Columns: []
Index: [Bangladesh, India, Australia]

In [0]:
df = df1

In [46]:
df

             Bangladesh  India Australia
Vice Captain      Tamim  Virat     Smith

#Adding a new column to DataFrame

just use the assignment operator after the square_bracket

```
df['Home'] = None
```

In [0]:
df['Home']=None

In [51]:
df

            Home
Bangladesh  None
India       None
Australia   None